Running into exactly the same issue:


```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.bootstrap.module.enable_cross_project_service_account_usage.google_project_organization_policy.project_policy_boolean[0] will be created
  + resource "google_project_organization_policy" "project_policy_boolean" {
      + constraint  = "constraints/iam.disableCrossProjectServiceAccountUsage"
      + etag        = (known after apply)
      + id          = (known after apply)
      + project     = "my-project"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = false
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.bootstrap.module.enable_cross_project_service_account_usage.google_project_organization_policy.project_policy_boolean[0]: Creating...
╷
│ Error: googleapi: Error 403: The caller does not have permission, forbidden
│ 
│   with module.bootstrap.module.enable_cross_project_service_account_usage.google_project_organization_policy.project_policy_boolean[0],
│   on .terraform/modules/bootstrap.enable_cross_project_service_account_usage/boolean_constraints.tf line 48, in resource "google_project_organization_policy" "project_policy_boolean":
│   48: resource "google_project_organization_policy" "project_policy_boolean" {
│ 
╵
```

Here's my terraform version readout

```
tf --version
Terraform v1.9.0
on darwin_arm64
+ provider registry.terraform.io/hashicorp/google v5.36.0
+ provider registry.terraform.io/hashicorp/google-beta v5.36.0
+ provider registry.terraform.io/hashicorp/null v3.2.2
+ provider registry.terraform.io/hashicorp/random v3.6.2
+ provider registry.terraform.io/hashicorp/time v0.11.2
```

I'm using v8 of this module

I have the `Organization Administrator` role with the user I'm trying to run this

the terraform provider also says this resource is deprecated: https://registry.terraform.io/providers/hashicorp/google/5.34.0/docs/resources/google_project_organization_policy